dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/src/stm32f2xx_flash_1208.c
/*******************************************************************************
  * @brief  Returns the FLASH Status.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PROGRAM,
  *                       FLASH_ERROR_WRP, FLASH_ERROR_OPERATION or FLASH_COMPLETE.
  *****************************************************************************/
FLASH_Status FLASH_GetStatus(void)
{
	FLASH_Status flashstatus = FLASH_COMPLETE;
  
	if((FLASH->SR & FLASH_FLAG_BSY) == FLASH_FLAG_BSY) 
	{
		flashstatus = FLASH_BUSY;
	}
	else 
	{  
		if((FLASH->SR & FLASH_FLAG_WRPERR) != (uint32_t)0x00)
		{ 
			flashstatus = FLASH_ERROR_WRP;
		}
		else 
		{
			if((FLASH->SR & (uint32_t)0xEF) != (uint32_t)0x00)
		  	{
		   		flashstatus = FLASH_ERROR_PROGRAM; 
		  	}
		  	else
		  	{
		    	if((FLASH->SR & FLASH_FLAG_OPERR) != (uint32_t)0x00)
		    	{
		    	  	flashstatus = FLASH_ERROR_OPERATION;
		    	}
		    	else
		    	{
		     		flashstatus = FLASH_COMPLETE;
		    	}
		  	}
		}
	}
	/* Return the FLASH Status */
	return flashstatus;
}

/*******************************************************************************
  * @brief  Waits for a FLASH operation to complete.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BUSY, FLASH_ERROR_PROGRAM,
  *                       FLASH_ERROR_WRP, FLASH_ERROR_OPERATION or FLASH_COMPLETE.
  *****************************************************************************/
FLASH_Status FLASH_WaitForLastOperation(void)
{
	u32 rtry = 0xffff;
	__IO FLASH_Status status = FLASH_COMPLETE;
   
	/* Check for the FLASH Status */
	status = FLASH_GetStatus();

	/* Wait for the FLASH operation to complete by polling on BUSY flag to be reset.
	 Even if the FLASH operation fails, the BUSY flag will be reset and an error
	 flag will be set */
	while(status == FLASH_BUSY && rtry--)
	{
		status = FLASH_GetStatus();
	}
	
	/* Return the operation status */
	return status;
}

/*******************************************************************************
  * @brief  Returns the write protection status of user flash area.
  * @param  None
  * @retval 0: No write protected sectors inside the user flash area
  *         1: Some sectors inside the user flash area are write protected
  *****************************************************************************/
uint16_t FLASH_If_GetWPStatus(uint32_t Addr)
{
	uint32_t uSector = GetSector(Addr);

	return FLASH_OB_GetWRP(uSector);

	/* 1: No write protected sectors inside the user flash area */
	/* 0: Some sectors inside the user flash area are write protected */
}

/*******************************************************************************
  * @brief  Disables the write protection of user flash area.
  * @param  None
  * @retval 1: Write Protection successfully disabled
  *         2: Error: Flash write unprotection failed
  ******************************************************************************/
uint32_t FLASH_WPDisable(uint32_t Addr)
{
	__IO uint32_t uSector = FLASH_Sector_1;

	/* Get the sector where start the user flash area */
	uSector = GetSector(Addr);

	/* Mark all sectors inside the user flash area as non protected */  
	//UserWrpSectors = 0xFFF-((1 << (UserStartSector/8))-1);

	/* Unlock the Option Bytes */
	FLASH_OB_Unlock();

	/* Disable the write protection for all sectors inside the user flash area */
	FLASH_OB_WRPConfig(uSector, DISABLE);

	/* Start the Option Bytes programming process. */  
	if (FLASH_OB_Launch() != FLASH_COMPLETE)
	{
		/* Error: Flash write unprotection failed */
		return (2);
	}

	/* Write Protection successfully disabled */
	return (1);
//FLASH_TypeDef
}

/*******************************************************************************
  * @brief  Gets the sector of a given address
  * @param  Address: Flash address
  * @retval The sector of a given address
  *****************************************************************************/
uint32_t GetSector(uint32_t Addr)
{
		 if(Addr < ADDR_FLASH_SECTOR_1)		return 0;
	else if(Addr < ADDR_FLASH_SECTOR_2) 	return 1;
	else if(Addr < ADDR_FLASH_SECTOR_3) 	return 2;
	else if(Addr < ADDR_FLASH_SECTOR_4) 	return 3;
	else if(Addr < ADDR_FLASH_SECTOR_5) 	return 4;
	else if(Addr < ADDR_FLASH_SECTOR_6) 	return 5;
	else if(Addr < ADDR_FLASH_SECTOR_7) 	return 6;
	else if(Addr < ADDR_FLASH_SECTOR_8) 	return 7;
	else if(Addr < ADDR_FLASH_SECTOR_9) 	return 8;
	else if(Addr < ADDR_FLASH_SECTOR_10)	return 9;
	else if(Addr < ADDR_FLASH_SECTOR_11)	return 10;
	else									return 11;

}


/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
